{"id": "tt0455326", "cast": [{"character": "Master Shake (voice)", "name": "Dana Snyder"}, {"character": "Frylock (voice)", "name": "Carey Means"}, {"character": "Meatwad / Carl / Ignignokt / Video Game Voice (voice)", "name": "Dave Willis"}, {"character": "Oglethorpe (voice)", "name": "Andy Merrill"}, {"character": "Chicken Bittle (voice)", "name": "Bruce Campbell"}, {"character": "Time Lincoln (voice)", "name": "Fred Armisen"}, {"character": "Walter Melon (voice)", "name": "Chris Kattan"}], "crew": [{"job": "Director", "name": "Matt Maiellaro"}, {"job": "Director", "name": "Dave Willis"}], "title": "Aqua Teen Hunger Force Colon Movie Film for Theaters", "genres": ["Animation", "Comedy"], "keywords": ["africa", "blood splatter", "surrealism", "blood", "robot", "adult animation"], "original_language": "English", "rating": "R", "release_date": "2007-04-13", "revenue": 0.0, "runtime": 86, "summary": "The story begins in Egypt, where Master Shake, Frylock and Meatwad are being attacked by an oversize poodle, who kills Frylock before being destroyed by Shake. Shake and Meatwad drive off with Frylock's corpse, and meet Time Lincoln, who plans to revive Frylock; however, when the CIA break into his house, the Aqua Teens flee in his wooden rocket ship, and Time Lincoln is shot. This, however, is all revealed to be an elaborate story concocted by Shake to explain the ATHF's origin to Meatwad. Shake then explains to Meatwad that women are only attracted to great bodies, then heads off to work out on his new exercise machine, the Insane-O-Flex. Together, they go in search of a missing piece of an exercise machine that happens to be more than an exercise machine, placing them on a collision course with the likes of Oglethorpe and Emory, a pair of jagged, ridiculous creatures from the future who travel with a robot companion claiming to be the Ghost of Christmas Past. They also encounter Dr...", "tmdb_score_value": 6.3, "tmdb_score_count": 43, "imdb_score_value": 6.9, "imdb_score_count": 12611, "meta_score_value": 54.0, "meta_score_count": 28}